#Выведите элементы данного списка в обратном порядке, не изменяя сам список.


lst = input().split()
print(*lst[::-1])